Revit 2025 API
WidthMeasuredAt Enumeration
 The allowed values for the WALL_TYPE_WIDTH_MEASURED_AT parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WidthMeasuredAt
Public Enumeration WidthMeasuredAt
public enum class WidthMeasuredAt
type WidthMeasuredAt
Members
Member name | Value | Description
Top | 0 |  The top of the wall taking into account the top offset before any attachment.
Base | 1 |  The base constraint of the wall.
Bottom | 2 |  The bottom of the wall taking into the base offset before any attachment.
See Also
Reference
Autodesk.Revit.DB Namespace